Core/src/AccumulationRegisters/ОстаткиНалоговыхЛьгот/ОстаткиНалоговыхЛьгот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНалоговыхЛьгот</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/ОстаткиНалоговыхЛьгот/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда  	
		Возврат;  		
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	ВнеоборотныеАктивы.НомерСтроки КАК НомерСтроки,
	|	ВнеоборотныеАктивы.Организация КАК Организация,
	|	ВнеоборотныеАктивы.Сотрудник КАК Сотрудник,
	|	ВнеоборотныеАктивы.Сумма КАК СуммаПередЗаписью,
	|	ВнеоборотныеАктивы.Сумма КАК СуммаИзменение,
	|	ВнеоборотныеАктивы.Сумма КАК СуммаПриЗаписи
	|ПОМЕСТИТЬ ДвиженияОстаткиНалоговыхЛьготИзменение
	|ИЗ
	|	РегистрНакопления.ОстаткиНалоговыхЛьгот КАК ВнеоборотныеАктивы");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияВнеоборотныеАктивыИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

#КонецОбласти

#КонецЕсли
